<script lang="ts">
import { defineComponent, onMounted, onUnmounted } from 'vue';
import { useStore } from '@/stores/store';

export default defineComponent({
    name: 'PrivatePolicyPopup',
    components: {},
    setup() {
        const store = useStore();

        const handleClickClose = () => {
            store.setOpenPopup(null);
        };

        onMounted(() => {
            document.body.style.height = '100%';
            document.body.style.overflowY = 'hidden';
        });

        onUnmounted(() => {
            document.body.style.height = 'max-content';
            document.body.style.overflowY = 'scroll';
        });

        return {
            handleClickClose
        };
    }
});
</script>

<template>
    <div class="popup-privacy-policy w-[460px] h-max absolute bg-white z-50">
        <div class="body-wrapper p-[15px]">
            <div class="header-wrapper flex justify-between">
                <div class="title pt-[20px] pl-[20px] text-[30px] font-[700]">개인정보처리방침</div>
                <div @click="handleClickClose" class="w-[35px] h-[35px]">
                    <img class="w-full h-full" src="/assets/images/icons/x-btn.svg" alt="닫기" />
                </div>
            </div>
            <div class="content-wrapper mt-[15px] mb-[20px] mx-[20px] w-[390px]">
                <p class="text-[12px] font-[400] overflow-y-scroll h-[415px] w-full">
                    개인정보보호정책<br />
                    더티클리닉은 귀하의 개인정보보호를 매우 중요시하며,
                    『정보통신망이용촉진등에관한법률』을 준수하고 있습니다.<br />
                    더티클리닉은 개인정보보호방침을 통하여 귀하께서 제공하시는 개인정보가 어떠한
                    용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고
                    있는지 알려드립니다.<br />
                    <br />
                    1. 개인정보 수집목적 및 이용목적<br />
                    더티클리닉은 이용자 확인, 이용대금 결제, 상품 배송 및 통계ㆍ분석을 통한 마케팅
                    자료로써 귀하의 취향에 맞는 최적의 서비스를 제공하기 위한 목적으로 귀하의
                    개인정보를 수집ㆍ이용하고 있습니다.<br />
                    수집하는 개인정보 항목에 따른 구체적인 수집목적 및 이용목적은 다음과
                    같습니다.<br />
                    ① 성명, 아이디, 비밀번호, 주민번호 : 회원제 서비스 이용에 따른 본인 확인 절차에
                    이용<br />
                    ② 이메일주소, 전화번호 : 고지사항 전달, 불만처리 등을 위한 원활한 의사소통
                    경로의 확보, 새로운 서비스 및 신상품이나 이벤트 정보 등의 안내<br />
                    ③ 은행계좌정보, 신용카드정보 : 유료정보 이용 및 상품 구매에 대한 결제<br />
                    ④ 주소, 전화번호, 휴대전화번호 : 청구서, 경품 및 물품 배송에 대한 정확한
                    배송지의 확보<br />
                    ⑤ 기타 선택항목 : 개인맞춤 서비스를 제공하기 위한 자료<br />
                    ⑥ 브라우저 종류 및 OS: 이용자의 사운드 카드 및 메인보드의 제조사 정보 수집으로
                    최적화 된 서비스 개발<br />
                    ⑦ 방문일시 및 통계: 이용자의 이용성향 및 맞춤 서비스 제공을 위한 자료<br />
                    <br />
                    2. 목적외 사용 및 제3자에 대한 제공 및 공유<br />
                    더티클리닉은 귀하의 동의가 있거나 관련법령의 규정에 의한 경우를 제외하고는
                    어떠한 경우에도 『개인정보의 수집목적 및 이용목적』에서 고지한 범위를 넘어
                    귀하의 개인정보를 이용하거나 타인 또는 타기업ㆍ기관에 제공하지 않습니다.<br />
                    귀하의 개인정보를 제공하거나 공유하는 경우에는 사전에 귀하에게 제공받거나
                    공유하는 자가 누구이며 주된 사업이 무엇인지, 제공 또는 공유되는 개인정보항목이
                    무엇인지, 개인정보를 제공하거나 공유하는 목적이 무엇인지 등에 대해 개별적으로
                    전자우편 또는 서면을 통해 고지한 후 이에 대한 동의를 구합니다. 다만, 다음의
                    경우에는 관련 법령의 규정에 의하여 귀하의 동의없이 개인정보를 제공하는 것이
                    가능합니다.<br />
                    ① 서비스제공에 따른 요금정산을 위하여 필요한 경우<br />
                    ② 주문상품의 배송을 위해 배송업체에게 최소한의 정보(성명, 주소, 연락처)를
                    제공하는 경우<br />
                    ③ 회원 관리, 시스템 관리, 정보의 제공 등을 위하여 Your Shopping Mall이 호스팅을
                    받는 업체에 제공하는 경우<br />
                    ④ 통계작성ㆍ학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 알아볼
                    수 없는 형태로 가공하여 제공하는 경우<br />
                    ⑤ 이용자가 스스로 제3자 서비스 이용을 위하여 이용자 정보 중 일부를 제3자에게
                    제공한 경우<br />
                    ⑥ 도용방지를 위하여 본인확인에 필요한 경우<br />
                    ⑦ 금융실명거래및비밀보장에관한법률, 신용정보의이용및보호에관한법률,
                    전기통신기본법, 전기통신사업법, 지방세법, 소비자보호법, 한국은행법, 형사소송법
                    등 법률에 특별한 규정이 있는 경우<br />
                    <br />
                    3. 개인정보 수집에 대한 동의<br />
                    더티클리닉은 귀하의 개인정보 수집에 대한 동의를 받고 있습니다. 귀하의 개인정보
                    수집과 관련하여 더티클리닉의 개인정보보호방침 또는 이용약관의 내용에 대해
                    「동의」버튼 또는 「취소」버튼을 클릭할 수 있는 절차를 마련하고 있으며, 귀하가
                    「동의」버튼을 클릭하면 개인정보 수집에 대해 동의한 것으로 봅니다.<br />
                    <br />
                    4. 개인정보관리책임자 및 개인정보관리담당자<br />
                    귀하의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 더티클리닉은
                    개인정보관리책임자를 두고 있습니다. 개인정보와 관련한 문의사항이 있으시면 아래의
                    개인정보관리책임자에게 연락주시기 바랍니다. 귀하의 문의사항에 신속하고 성실하게
                    답변해드리겠습니다.<br />
                    개인정보관리책임자<br />
                    - 성 명: 최문석 / - 전 화: 010-3352-0037<br />
                    - E-mail: chlanstjr96@naver.com<br />
                    <br />
                    5. 개인정보수집<br />
                    더티클리닉은 회원가입시 서비스 이용을 위해 필요한 최소한의 개인정보만을
                    수집합니다. 귀하가 더티클리닉의 서비스를 이용하기 위해서는 회원가입시 희망
                    IDㆍ비밀번호, 성명, 주소, 전화번호, E-mail주소를 필수적으로 입력하셔야 합니다.
                    그러나, 직업, 취미, 관심분야와 같은 선택 항목은 이를 입력하지 않더라도 서비스
                    이용에는 제한이 없습니다.<br />
                    귀하가 더티클리닉의 상품을 구입하거나 유로 컨텐츠를 이용하시고자 하는 경우에는
                    대금결제 및 상품배송을 위하여 다음과 같은 추가정보를 입력하셔야 합니다.<br />
                    ① 결제방법에 따라<br />
                    - 계좌이체의 경우 : 거래은행명, 계좌번호, 거래자 성명<br />
                    - 카드결제의 경우 : 신용카드종류, 카드번호, 유효기간, 비밀번호<br />
                    - 휴대폰 결제의 경우 : 휴대폰번호<br />
                    - 기타 전자적 결제의 경우 : 해당 전자결제에서 필요로 하는 정보<br />
                    ② 상품배송에 필요한 정보로서 상품을 보내는 사람과 받는 사람의 성명, 주소 및
                    전화번호 등 연락처<br />
                    <br />
                    6. 쿠키에 의한 개인정보 수집<br />
                    더티클리닉은 귀하의 정보를 수시로 저장하고 찾아내는 ‘쿠키(cookie)'를 운용합니다.
                    쿠키란 더티클리닉 웹사이트를 운영하는데 이용되는 서버가 귀하의 브라우저에 보내는
                    아주 작은 텍스트 파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다.<br />
                    더티클리닉은 다음과 같은 목적을 위해 쿠키를 사용합니다.<br />
                    - 회원과 비회원의 접속 빈도나 방문 시간 등을 분석하고 이용자의 취향과 관심분야를
                    파악하여 타겟마케팅 및 서비스 개편 등의 척도로 활용합니다.<br />
                    - 한 품목들에 대한 정보와 관심있게 둘러본 품목들에 대한 자취를 추적하여 차후의
                    때 개인 맞춤 서비스를 제공하는 데 이용합니다.<br />
                    - 더티클리닉이 진행하는 각종 이벤트에서 귀하의 참여 정도 및 방문 회수를 파악하여
                    차별적인 응모 기회를 부여하고 개인의 관심 분야에 따라 차별화된 정보를 제공하기
                    위한 자료로 이용됩니다.<br />
                    귀하는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 귀하는 웹브라우저에서
                    옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을
                    거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.<br />
                    - 쿠키설정을 거부하는 방법은 인터넷 익스플로어의 "도구" 메뉴에서 "인터넷 옵션"을
                    선택하신 후 "개인정보" 탭으로 들어가서 설정 수준을 "최고 수준"으로 지정시면
                    됩니다. 하지만, 회원님께서 쿠키 설치를 거부하셨을 경우 더티클리닉의 서비스
                    제공에 어려움이 있습니다.<br />
                    <br />
                    7. 개인정보의 열람ㆍ정정 방법<br />
                    귀하는 언제든지 등록되어 있는 귀하의 개인정보를 열람하거나 정정하실 수 있습니다.
                    귀하의 개인정보에 대한 열람 또는 정정을 하고자 할 경우에는 『개인정보수정』을
                    클릭하여 본인 확인 절차를 거치신 후 직접 열람 또는 정정하거나,
                    개인정보관리책임자에게 서면, 전화 또는 E-mail로 연락하시면 지체없이
                    조치하겠습니다.<br />
                    귀하가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지
                    당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게
                    이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이
                    이루어지도록 조치하겠습니다.<br />
                    <br />
                    8. 회원탈퇴 방법<br />
                    귀하는 회원가입시 개인정보의 수집ㆍ이용 및 제공에 대해 동의하신 내용을 언제든지
                    철회하실 수 있습니다. 회원탈퇴는 더티클리닉의 『고객센터』페이지에서
                    『회원탈퇴』메뉴를 클릭하여 직접 회원탈퇴를 하시거나, 개인정보관리책임자에게
                    서면, 전화 또는 E-mail 등으로 연락하시면 지체없이 귀하의 개인정보를 파기하는 등
                    필요한 조치를 하겠습니다.<br />
                    <br />
                    9. 개인정보의 보유기간 및 이용기간<br />
                    더티클리닉은 개인정보의 수집목적 또는 제공받은 목적이 달성된 때에는 귀하의
                    개인정보를 지체없이 파기합니다.<br />
                    ① 회원가입정보의 경우: 회원퇄퇴를 하거나 회원에서 제명된 때<br />
                    ② 대금지금정보의 경우: 대금의 완제일 또는 채권소멸시효기간이 만료된 때<br />
                    ③ 배송정보의 경우: 물품 또는 서비스가 인도되거나 제공된 때<br />
                    ④ 설문조사, 이벤트 등의 목적을 위하여 수집한 경우: 당해 설문조사, 이벤트 등이
                    종료한 때<br />
                    다만, 수집목적 또는 제공받은 목적이 달성된 경우에도 상법 등 관계 법령의 규정에
                    의하여 보존할 필요성이 있는 경우에는 귀하의 개인정보를 보유할 수 있습니다.<br />
                    - 계약 또는 청약철회 등에 관한 기록 : 5년<br />
                    - 대금결제 및 재화등의 공급에 관한 기록 : 5년<br />
                    - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br />
                    <br />
                    10. 만14세 미만의 아동의 개인정보보호<br />
                    만14세 미만 아동(이하 “아동”이라 함)의 회원가입은 법정대리인의 동의를 구하여
                    처리가 되고 있습니다.<br />
                    더티클리닉은 법정대리인의 동의를 받기 위하여 아동으로부터 법정대리인의 성명과
                    연락처 등 최소한의 정보를 수집하고 있으며, 『개인정보보호지침』에서 규정하고
                    있는 방법에 따라 법정대리인의 동의를 받고 있습니다.<br />
                    아동의 법정대리인은 아동의 개인정보에 대한 열람, 정정 및 삭제를 요청할 수
                    있습니다. 아동의 개인정보를 열람ㆍ정정, 삭제하고자 할 경우에는
                    『개인정보수정』을 클릭하여 아동의 개인정보를 법정대리인이 직접 열람ㆍ정정,
                    삭제하거나, 개인정보관리책임자에게 서면, 전화, 또는 E-mail로 연락하시면 지체없이
                    필요한 조치를 취합니다.<br />
                    더티클리닉은 아동에 관한 정보를 제3자에게 제공하거나 공유하지 않으며,
                    아동으로부터 수집한 개인정보에 대하여 법정대리인이 오류의 정정을 요구하는 경우
                    그 오류를 정정할 때까지 해당 개인정보의 이용 및 제공을 금지합니다.<br />
                    <br />
                    11. 개인정보보호 대책<br />
                    ① 더티클리닉은 이용자의 개인정보를 취급함에 있어서 개인정보가 분실, 도난, 누출,
                    변조 또는 훼손되지 아니하도록 안전성 확보를 위하여 기술적 대책을 시행합니다.<br />
                    ② ID와 비밀번호를 이용하여 허가된 이용자만이 허가된 정보에만 접근할 수 있도록
                    합니다. SSL 암호화방식을 이용하여 네트워크상에서 개인정보를 암호화하여
                    전송합니다.<br />
                    지불정보는 별도로 강력한 보안프로토콜을 활용하여 암호화하여 처리합니다.<br />
                    ③ 더티클리닉은 이용자의 개인정보에 대한 접근 및 관리에 필요한 절차를 마련하고
                    개인정보 관리자를 지정하여 운영하고 있으며 또한 개인정보를 처리하는 시스템에
                    대한 접근 통제를 위한 비밀번호를 부여하고 주기적으로 갱신합니다.<br />
                    ④ 더티클리닉은 개인정보(회원정보)를 일반데이터와 분리하여 별도의 데이터베이스에
                    보관합니다.<br />
                    개인정보에 대한 접근은 필수정보에 대하여는 고객센터와 개인정보 관리자 그리고
                    선택정보에 대해서는 개인정보관리자만이 접근가능하며 별도의 ID와 비밀번호를
                    부여하여 로그인시 확인하고 있으며 또한 철저하게 관리합니다. 시스템실는 출입은
                    인가 받은 자만이 출입할 수 있도록 통제합니다. 그리고 시스템실에는 출입자명부를
                    비치 출입내역을 기록합니다. 개인정보는 출력하여 보관하지 아니합니다.<br />
                    ⑤ 장애 발생에 대비하여 시스템은 이중으로 운영하고 또한 정기적으로 개인정보를
                    백업하여 보관합니다. 또한 시스템운영자가 24시간 상주하여 시스템을 감시하고
                    있으며, 비상시에는 응급조치절차를 비치하여 대비하고 있습니다. 회선 상태를 포함한
                    시스템 상태는 시스템 운영자가 정기(매일점검, 주간점검, 월간점검)점검을 실시하며
                    필요시 부정기 점검을 실시합니다.<br />
                    <br />
                    12. 개인정보침해 관련 상담 및 신고<br />
                    개인정보침해에 대한 신고ㆍ상담이 필요하신 경우에는 정보통신부 산하 공공기관인
                    한국정보보호진흥원(KISA)내 개인정보침해신고센터로 문의하시기 바랍니다.<br />
                    ☞ 개인정보침해신고센터<br />
                    -전화: 118<br />
                    -URL: https://www.kisa.or.kr/<br />
                    <br />
                    13. 정책 변경에 따른 공지의무<br />
                    이 개인정보보호방침은 2024년 9월 1일에 제정되었으며 법령ㆍ정책 또는 보안기술의
                    변경에 따라 내용의 추가ㆍ삭제 및 수정이 있을 시에는 변경되는 개인정보보호정책을
                    시행하기 최소 10일 전에 더티클리닉 홈페이지를 통해 변경이유 및 내용 등을
                    공지하도록 하겠습니다.<br />
                </p>
            </div>
        </div>
    </div>
</template>
