<script lang="ts">
import { defineComponent, onMounted, onUnmounted } from 'vue';
import { useStore } from '@/stores/store';

export default defineComponent({
    name: 'TermsOfUsePopup',
    components: {},
    setup() {
        const store = useStore();

        const handleClickClose = () => {
            store.setOpenPopup(null);
        };

        onMounted(() => {
            document.body.style.height = '100%';
            document.body.style.overflowY = 'hidden';
        });

        onUnmounted(() => {
            document.body.style.height = 'max-content';
            document.body.style.overflowY = 'scroll';
        });

        return {
            handleClickClose
        };
    }
});
</script>

<template>
    <div class="popup-terms-of-use w-[460px] h-max absolute bg-white z-50">
        <div class="body-wrapper p-[15px]">
            <div class="header-wrapper flex justify-between">
                <div class="title pt-[20px] pl-[20px] text-[30px] font-[700]">이용약관</div>
                <div @click="handleClickClose" class="w-[35px] h-[35px]">
                    <img class="w-full h-full" src="/assets/images/icons/x-btn.svg" alt="닫기" />
                </div>
            </div>
            <div class="content-wrapper mt-[15px] mb-[20px] mx-[20px] w-[390px]">
                <p class="text-[12px] font-[400] overflow-y-scroll h-[415px] w-full">
                    전자상거래(인터넷사이버몰) 표준약관<br />
                    공정거래위원회 표준약관 제10023호<br />
                    ※ 더티클리닉은 공정거래위원회에서 심의한 표준약관을 사용하고 있음.<br /><br />
                    [ 제 1장 총칙 ]<br />
                    제 1조 (목적)<br />
                    본이용약관은 더티클리닉(이하 "당사"이라 한다)이 운영, 제공하는 인터넷 사이트
                    서비스 이용함에 있어 이용자의 권리, 의무 및 책임사항을 규정함을 목적으로
                    합니다.<br />
                    웹서비스, 모바일 서비스, 앱서비스를 이용하는 전자거래에 대해서도 그 성질에
                    반하지 않는 한 이 약관을 준용합니다.<br /><br />
                    제 2조 (정의)<br />
                    이 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br />
                    ① 이용자라 함은 "당사" 에 접속하여 이 약관에 따라 "당사" 이 제공하는 서비스를
                    받는 회원 및 비회원을 말합니다.<br />
                    ② "회원"이라 함은 "당사" 에 개인정보를 제공하여 회원등록을 한 자로서, "당사" 의
                    정보를 지속적으로 제공받으며, "당사" 이 제공하는 서비스를 계속적으로 이용할 수
                    있는 자를 말합니다.<br />
                    ③ 비회원이라 함은 회원에 가입하지 않고 "당사" 이 제공하는 서비스를 이용하는 자를
                    말합니다.<br /><br />
                    제 3조 (약관의 명시와 설명 및 개정)<br />
                    ① "당사"는 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호,
                    연락처(전화, 팩스, 전자우편 주소 등) 등을 이용자가 알 수 있도록 "당사"의 초기
                    서비스화면(전면)에 게시합니다.<br />
                    ② "당사"는 약관의 규제에 관한 법률, 전자거래기본법, 전자서명법,
                    정보통신망이용촉진 등에 관한 법률, 방문판매 등에 관한 법률, 소비자보호법 등
                    관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.<br />
                    ③ "당사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 초기화면이나 팝업화면에
                    해당 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.<br />
                    ④ "당사"가 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는
                    계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이
                    그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가 개정약관 조항의 적용을
                    받기를 원하는 뜻을 제3항에 의한 개정약관의 공지 기간 내에 "당사"에 송신하여
                    "당사"의 동의를 받은 경우에는 개정약관 조항이 적용됩니다.<br />
                    ⑤ 이용자가 가입 시 동의한 약관에 대해서 이용자가 열람을 요구할 경우.<br />
                    이용자가 가입 시 기재한 이메일주소로 전송해드립니다.<br />
                    ⑥ 회원은 변경된 약관에 대해 거부할 권리가 있습니다. 본 약관의 변경에 대해 이의가
                    있는 회원은 서비스이용을 중단하고 이용계약을 해지(회원탈퇴)할 수 있습니다. 상기
                    7일 이내에 회원탈퇴를 하지 않은 회원은 개정약관에 동의한 것으로 간주합니다.<br />
                    ⑦ 이 약관에 동의하는 것은 정기적으로 홈페이지를 방문하여 약관의 변경사항을
                    확인하는 것에 동의하는 것을 의미합니다.<br />
                    ⑧ 본 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한
                    전자거래소비자보호지침 및 관계법령 또는 상관례에 따릅니다.<br /><br />
                    제 4 조(서비스의 중단)<br />
                    ① "당사"는 컴퓨터 등 정보통신설비의 보수 점검,교체 및 고장, 통신의 두절 등의
                    사유가 발생한 경우에는 서비스 제공을 일시적으로 중단할 수 있습니다.<br />
                    ② 사업종목의 전환, 사업의 포기, 업체 간 통합 등의 이유로 서비스를 제공할 수 없게
                    되는 경우에는 "당사"에서 정한 방법으로 이용자에게 통지하게 됩니다.<br />
                    ③ 천재 지변 태풍, 폭설, 폭우, 지진 등으로 이동 제한의 경우 서비스 제공을
                    일시적으로 중단할 수 있습니다.<br />
                    ④ "당사"의 직원이 질병 또는 전염병에 노출이 우려될 경우 서비스 제공을 일시적으로
                    중단할 수 있습니다.<br /><br />
                    [ 제 2장 회원가입 계약 ]<br />
                    제 5조(회원가입)<br />
                    ① 이용자는 "당사"가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에
                    동의한다는 의사표시를 함으로서 회원가입을 신청합니다.<br />
                    ② "당사"는 위와 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지
                    않는 한 회원으로 등록합니다.<br />
                    1. "당사" 은 법정대리인의 동의를 받기 위하여 아동으로부터 법정대리인의 성명과
                    연락처 등 최소한의 정보를 수집하고 있으며, 『개인정보보호지침』에서 규정하고
                    있는 방법에 따라 법정대리인의 동의를 받고 있습니다.<br />
                    2. 아동의 법정대리인은 아동의 개인정보에 대한 열람, 정정 및 삭제를 요청할 수
                    있습니다. 아동의 개인정보를 열람ㆍ정정, 삭제하고자 할 경우에는
                    『개인정보수정』을 클릭하여 아동의 개인정보를 법정대리인이 직접 열람ㆍ정정,
                    삭제하거나, 개인정보관리책임자에게 서면, 전화, 또는 E-mail로 연락하시면 지체없이
                    필요한 조치를 취합니다.<br />
                    3. "당사" 은 아동에 관한 정보를 제3자에게 제공하거나 공유하지 않으며,
                    아동으로부터 수집한 개인정보에 대하여 법정대리인이 오류의 정정을 요구하는 경우
                    그 오류를 정정할 때까지 해당 개인정보의 이용 및 제공을 금지합니다.<br />
                    4. 회원자격 제한 또는 정지 이력이 있는이용자 ③ 회원가입계약의 성립시기는 "당사"
                    의 승낙이 회원에게 도달한 시점으로 합니다.<br />
                    ④ 만14세 미만 아동(이하 “아동”이라 함)은 아동정보보호에 따라, 회원가입은
                    법정대리인의 동의를 구하여 처리가 되고 있습니다.<br />
                    ⑤ "당사" 은 법정대리인의 동의를 받기 위하여 아동으로부터 법정대리인의 성명과
                    연락처 등 최소한의 정보를 수집하고 있으며, 『개인정보보호지침』에서 규정하고
                    있는 방법에 따라 법정대리인의 동의를 받고 있습니다.<br />
                    ⑥ 아동의 법정대리인은 아동의 개인정보에 대한 열람, 정정 및 삭제를 요청할 수
                    있습니다. 아동의 개인정보를 열람ㆍ정정, 삭제하고자 할 경우에는
                    『개인정보수정』을 클릭하여 아동의 개인정보를 법정대리인이 직접 열람ㆍ정정,
                    삭제하거나, 개인정보관리책임자에게 서면, 전화, 또는 E-mail로 연락하시면 지체없이
                    필요한 조치를 취합니다.<br />
                    ⑦ "당사" 은 아동에 관한 정보를 제3자에게 제공하거나 공유하지 않으며,
                    아동으로부터 수집한 개인정보에 대하여 법정대리인이 오류의 정정을 요구하는 경우
                    그 오류를 정정할 때까지 해당 개인정보의 이용 및 제공을 금지합니다.<br /><br />
                    제 6 조(회원 탈퇴 및 자격 상실 등)<br />
                    ① 회원은 "당사"에 언제든지 탈퇴를 요청할 수 있으며 "당사"는 즉시 회원 탈퇴를
                    처리합니다.<br />
                    1. 가입 신청 시에 허위 내용을 등록한 경우<br />
                    2. “당사”의 웹사이트 또는 모바일 어플리케이션을 통해 거래한 “당사” 서비스 이용에
                    관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우<br />
                    3. 다른 사람의 “당사”이용을 방해하거나 그 정보를 도용하는 등 전자상거래질서를
                    위협하는 경우<br />
                    4. “당사”를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를
                    하는 경우<br />
                    5. 기타 다음과 같은 행위 등으로 “당사”의 건전한 운영을 해하거나 “당사”의 업무를
                    방해하는 경우<br />
                    - “당사”의 운영에 관련하여 근거 없는 사실 또는 허위의 사실을 적시하거나 유포하여
                    “당사”의 명예를 실추시키고 “당사”의 신뢰성을 해하는 경우<br />
                    - “당사”의 운영과정에서 이유 없는 잦은 연락이나 소란 또는 협박, 인과관계가
                    입증되지 않는 피해에 대한 보상(적립금, 현금, 상품)요구 등으로 업무를 방해하는
                    경우<br />
                    - “당사”를 통해 구입한 상품 또는 서비스에 특별한 하자가 없는데도 불구하고 일부
                    사용 후 상습적인 취소,전부 또는 일부 반품 등으로 "당사"의 업무를 방해하는
                    경우.단, 당해 회원의 취소 반품비율이 "당사"의 평균 취소 반품율보다 50%이상 높을
                    경우에는 상습적인 것으로 인정될 수 있습니다<br />
                    ② 회원이 다음 각 호의 사유에 해당하는 경우,”"당사"”는 회원자격을 제한 및
                    정지시킬 수 있습니다.<br />
                    ③ "당사"가 회원 자격을 제한,정지 시킨 후 동일한 행위가 2 회 이상 반복되거나 30
                    일 이내에 그 사유가 시정되지 아니하는 경우 "당사"는 회원자격을 상실시킬 수
                    있습니다.<br />
                    ④ "당사"가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다.<br />
                    이 경우 회원에게 이를 통지하고 회원등록 말소 전에 최소한 30 일 이상의 기간을
                    정하여 소명할 기회를 부여합니다.<br /><br />
                    제 7조 (회원에 대한 통지)<br />
                    ① "당사"가 회원에 대한 통지를 하는 경우, 회원이 "당사"에 제출한 전자우편 주소로
                    할 수 있습니다.<br />
                    ② "당사"는 불특정다수 회원에 대한 통지의 경우 게시판에 게시함으로써 개별 통지에
                    상응할 수 있습니다.<br /><br />
                    제 8조 (개인정보 보호)<br />
                    ① "당사"는 이용자의 정보수집 시 구매계약 이행에 필요한 최소한의 정보를
                    수집합니다.<br />
                    ② 다음 사항을 필수사항으로 하며 그 외 사항은 선택사항으로 합니다.<br />
                    ③ "당사"는 이용자의 개인식별이 가능한 개인정보를 수집하는 때에는 반드시 당해
                    이용자의 동의를 받습니다.<br />
                    ④ 제공된 개인정보는 당해 이용자의 동의 없이 목적 외의 이용이나 제3자에게 제공할
                    수 없으며, 이에 대한 모든 책임은 "당사"가 집니다. 단, 판매자에 의하여 목적 외로
                    이용되거나 제3자에게 제공되는 경우에는 "당사"의 귀책사유가 있는 경우에만 책임을
                    집니다. 다만, 다음의 경우에는 예외로 합니다.<br />
                    ⑤ "당사"는 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속,
                    성명 및 전화번호 기타 연락처), 정보의 수집목적 및 이용목적, 제3자에 대한
                    정보제공 관련사항(제공받는 자, 제공목적 및 제공할 정보의 내용)등
                    정보통신망이용촉진 등에 관한 법률 제 21조 제2항이 규정한 사항을 미리 명시하거나
                    고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.<br />
                    ⑥ "당사"는 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속,
                    성명 및 전화번호 기타 연락처), 정보의 수집목적 및 이용목적, 제3자에 대한
                    정보제공 관련사항(제공받는 자, 제공목적 및 제공할 정보의 내용)등
                    정보통신망이용촉진 등에 관한 법률 제 21조 제2항이 규정한 사항을 미리 명시하거나
                    고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.<br />
                    ⑦ 이용자는 언제든지 "당사"가 가지고 있는 자신의 개인정보에 대해 열람 및
                    오류정정을 요구할 수 있으며 "당사"는 이에 대해 지체 없이 필요한 조치를 취할
                    의무를 집니다.<br />
                    이용자가 오류의 정정을 요구한 경우에는 "당사"는 그 오류를 정정할 때까지 당해
                    개인정보를 이용하지 않습니다.<br />
                    ⑧ "당사"는 개인정보 보호를 위하여 관리자를 한정하여 그 수를 최소화하며 신용카드,
                    은행계좌 등을 포함한 이용자의 개인정보의 분실, 도난, 유출, 변조 등으로 인한
                    이용자의 손해에 대하여 모든 책임을 집니다.<br />
                    ⑨ "당사"로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은
                    목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다. 단, 사이버캐쉬의
                    이용과 관련한 개인정보는 관련 회계처리가 모두 종료되는 시점에 파기합니다.<br />
                    ⑩ 이용계약이 종료된 경우, "당사"는 당해 회원의 정보를 파기하는 것을 원칙으로
                    합니다. 다만, 아래의 경우에는 회원 정보를 보관합니다. 이 경우 "당사"는 보관하고
                    있는 회원 정보를 그 보관의 목적으로만 이용합니다.<br />
                    1. 상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여
                    보존할 필요가 있는 경우 당사는 관계법령에서 정한 일정한 기간 동안 회원 정보를
                    보관합니다.<br />
                    2. 당사를 통하여 물품을 매매(등록, 판매를 포함)한 내역이 있는 판매자에 대하여
                    이용계약이 종료된 경우, 당사는 거래당사자들에 대한 정보제공과 이 약관에 정한
                    제한을 의도적으로 회피하기 위한 임의해지를 방지하기 위하여 이용계약종료 후
                    6개월간 아이디(ID), 성명 또는 상호, 연락처, 주소 등을 보관하며, 전자상거
                    래등에서의 소비자보호법률 시행령 제 6조에 명기된 사항들의 보존기간을
                    준수합니다.<br />
                    3. 당사가 이용계약을 해지하거나 당사로부터 이 약관이 정한 판매자 자격정지조치를
                    받은 판매자에 대해서는 재가입에 대한 승낙거부사유가 존재하는지 여부를 확인하기
                    위한 목적으로 이용계약종료 후 5년간 아이디(ID), 성명 또는 상호, 연락처, 주소,
                    해지와 판매자 자격정지와 관련된 정보 등 최소한의 필요정보를 보관합니다.<br />
                    4. 기타 정보수집에 관한 동의를 받을 때 보유기간을 명시한 경우에는 그
                    보유기간까지 회원 정보를 보관합니다.<br /><br />
                    [ 제 3장 "당사"의 서비스 ]<br />
                    제 9조 (서비스의 제공)<br />
                    ① "당사"는 다음과 같은 업무를 수행합니다.<br />
                    1. 재화 또는 용역에 대한 정보 제공 및 구매계약<br />
                    2. 기타 당사가 정하는 업무 등<br />
                    ② "당사"가 제공하는 서비스는 아래와 같습니다.<br />
                    1. 입주, 이사, 거주, 부분, 정기청소, 정리<br />
                    2. 가전/ 공기질 클리닉<br />
                    3. 특수 청소<br />
                    4. 전문시공<br />
                    ③ "당사"는 구매자와 "당사"의 안정성 및 신뢰성을 증진시키는 도구만을
                    제공합니다.<br />
                    ④ "당사"가 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화의 품절 또는
                    기술적 사양의 변경 등의 사유로 변경할 경우에는 "당사"는 이로 인하여 이용자가
                    입은 손해를 본약관 11조, 13조, 15조에 의하여 배상합니다. 단, "당사"에 고의 또는
                    중대한 과실이 없는 경우에는 그러하지 아니합니다."<br /><br />
                    제 10조 (서비스의 이용 및 예약)<br />
                    ① 서비스의 이용은 1년 중 일요일과 법정공휴일을 제외하여, 아래와 같습니다.<br />
                    ② "서비스 시간은 근무장소의 작업량 및 작업환경에 따라서 다소 차이가 있을 수
                    있습니다."<br />
                    ③ "예약은 온라인 상으로 ""당사""와 대표전화 를 통해 이루어지며, 견적을 받아
                    진행하는 경우에도 ""당사"" 웹페이지에서 결제 및 예약을 확인하셔야 합니다."<br />
                    ④ "예약은 서비스 시점으로부터 3일(72시간)전 인터넷 및 대표전화를 통해
                    예약가능합니다."<br />
                    ⑤ "인터넷 예약 신청 고객에 대해서는 예약시간으로부터 3시간 이내에 주문확정
                    전화가 고객님께 가게 됩니다."<br />
                    ⑥ 예약 변경은 서비스 시작일로부터 24시간 이전에 가능합니다.<br />
                    ⑦ "서비스 시작일로부터 24시간 이내의 예약변경은 불가능하며, 제 13조 ' 주문취소와
                    변경 및 환불'에 따라 예약 요청 시점에 따른 패널티를 부여받으신 이후에 재주문
                    해주셔야 합니다."<br />
                    ⑧ 주문 후 3시간 이내에 입금해 주시지 않을 경우, 주문은 자동으로 취소됩니다.<br /><br />
                    제 11조 (서비스 예약금)<br />
                    ① 예약금 규정은 아래와 같습니다.<br />
                    1. "고객은 당사에 서비스를 신청하고 예약금을 납부함과 동시에 본 약관에 의거하여
                    예약금의 내용 및 소개행위 이외에 부가적인 서비스를 제공받을 것을 청약한 것이며
                    당사가 이에 승락함으로써 양 당사자의 합치된 의사로 계약은 성립되고 서비스가
                    제공됩니다."<br />
                    2. 서비스가 진행된 부분에 대한 예약금은 환불되지 않습니다.<br />
                    <br />
                    제 12조 (주문취소와 변경 및 환불)<br />
                    ① "고객은 ""당사""를 통해 제공받는 서비스의 주문취소 및 변경이 가능하며, 아래와
                    같은 제한사항이 있습니다."<br />
                    해당 내용은 법적효력이 있을 수 있으며, 꼼꼼히 읽어보시기 바랍니다.<br />
                    -청소하기 3일~2일전 취소시 예약금 환불 불가 ( 날짜 변경 가능 )<br />
                    -청소하기 전일 ~ 당일 취소시 예약금 환불 불가 및 위약금 발생 (날짜 변경
                    불가능)<br />
                    -※고객님 귀책사유로 현장 철수 혹은 예약 취소시 예약금을 제외한 잔금의 30% 위약금
                    발생※<br />
                    ② "당사"는 원칙적으로 서비스 이용료를 환불하지 않습니다.<br />
                    단 아래와 같은 경우 제외 합니다.<br />
                    1. 컨텐츠의 특성상 거래의 취소 및 환불은 불가능하며 이중과금일 경우
                    환불합니다.<br />
                    2. 단, "당사" 사정으로 인한 취소 및 일정 변경은 예약 금 환불이 가능합니다.<br />
                    ③”당사"의 작업 철수 규정은 아래와 같습니다.<br />
                    1.현장 방문 시 다른 공정(작업)과 겹치는 경우<br />
                    2.현장에 전기 및 조명이 없어 작업이 불가능한 경우(욕실 및 창이 없는 공간 작업
                    불가)<br />
                    3.현장 상황이나 정보가 고객님께서 알려주신 내용과 다를 경우<br />
                    4.고객과 연락이 안 되어 현장에서 60분 이상 기다렸을 경우<br />
                    5.현장의 상황에 따라 발생된 추가의 비용이나 작업 범위 조율이 고객과 협의가 안될
                    경우<br />
                    ##고객님 당일 혹은 전날 예약취소시 예약금을 제외한 잔금의 30% 위약금 발생<br />
                    ##고객님 당일 혹은 전날 예약취소 후 다른날로 예약 변경시 기존 예약금은 환불되지
                    않으며, 예약 변경에 대한 추가 예약금을 지불하셔야하고, 별도의 위약금은 없음<br />
                    6. 사이청소를 진행하시는 경우 고객님이 원하시는 투입 시간으로부터 합의가 된
                    청소시간에 대하여 이사나 , 입주 잔금처리 문제 등 고객님 귀책사유로 인하여 투입
                    혹은 철수가 지연될 경우에는 청소 진행의 어려움이 있어 철수하거나 시간 연장에
                    대한 추가비용이 발생하실 수 있습니다.<br />
                    시간 연장시 1시간당 10만원입니다.<br />
                    ④“당사"의 추가금 규정은 아래와 같습니다.<br />
                    1. 엘레베이터가 없어 장비를 들고 옮기는 경우 (3층이상부터 1만원) → 장비가 80kg~
                    100kg됩니다.<br />
                    2.처음 문의주신 평수보다 더 클 경우(분양 평수 기준,알파룸)<br />
                    3. 방1 창1개 기준으로 창문 개수가 더 많을 경우<br />
                    4.상담시 내용과는 다른 통베란다로 이루어진 베란다일 경우<br />
                    5.스티커, 본드성, 페인트, 단열재 자국 제거 진행시<br />
                    6.곰팡이 범위가 넓거나 심할경우 제거와 소독 진행시<br />
                    7.새집증후군 시공(국내 유일 효과 검증 제품 사용)<br />
                    8.분진 및 오염도가 심한 경우 (담당팀장 현장 판단)<br />
                    - 니코틴 자국 , 톱밥분진이나 백시멘트 등 인테리어 후 뒤처리가 미흡할 경우<br />
                    - 반려동물 털(강아지, 고양이) 등 제거시<br />
                    (걸레 재사용 불가,청소장비 고장이날수있습니다.)<br />
                    9.기본 붙박이장 외에 추가되어 있는 장롱, 수납장 등<br />
                    10.가전제품 내부청소(세탁기, 에어콘, 식기세척기, 오븐, 냉장고 등) - 내부살균소독
                    서비스<br />
                    11.적절하지 못한 방법 또는 과도한검수로 인한 퇴실 지연 및 청소의 불만족사항
                    청소불가<br />
                    예)물티슈,알콜솜,면봉,흰장갑 등<br />
                    12.고객님의 귀책사유로 청소가 지연될 경우(잔금처리 , 인테리어 공사 등)<br />
                    13.입주청소로 예약하시는 고객님에 한해서 현장 확인시 거주청소로 판단이 될
                    경우에는 추가 요금이 발생됩니다. (입주청소, 이사청소는 짐이 없는 공실 상태에서
                    진행합니다)<br />
                    14.거주청소의 경우 수납장 내부에 있는 짐은 건들지 않고 겉면만 진행하는 것이
                    원칙입니다. (물건의 도난이나 훼손의 우려가 있어 최대한 작업 안하시는 걸
                    추천드립니다.)<br />
                    -내부 짐들을 모두 빼서 작업 후 다시 넣어드리거나 ,정리정돈 , 설거지 등 집기나
                    식기류 등에 대한 작업을 원하시면 추가요금 발생됩니다.<br />
                    -외부창은 작업 불가입니다.<br />
                    -유료주차시 주차비는 고객님 부담입니다.<br />
                    현금영수증, 카드결제, 세금계산서 발행시 부가세 10%는 별도로 들어갑니다.
                    (카드결제는 미리 말씀해주세요. 현장 요청시 카드결제가 어려울 수 있습니다.)<br />
                    ⑤“당사"의 AS규정은 아래와 같습니다.<br />
                    1.현장 당일 검수 불가능 하신경우 당일 결제는 완료 되어야 하며, 추후 A/S는 청소
                    끝난 후 후공정이 없는 기준 5일 이내로 가능합니다. (후공정 예시 : 인테리어 후
                    보수, 이사, 에어컨 설치, 붙박이장 설치 등 청소 후 일어나는 모든 공정이 있을 경우
                    A/S는 불가능 합니다.)<br />
                    2.당일 검수 후 추후 A/S는 불가능 합니다.<br />
                    <br />
                    제 13조 (파손 등의 배상)<br />
                    ① 파손 사고시 처리 원칙은 아래와 같습니다.<br />
                    1. 월급제의 경우 당사는 원칙적으로 배상의 책임이 없지만 일정한 요건하에서 고객의
                    재산권을 보호하기 위하여 예외적으로 다음과 같은 내용으로 "당사"가 배상을
                    합니다.<br />
                    2. 파손 사고는 과실이 인정되는 통상 손해를 내부 배상 기준 및 한국소비자보호원의
                    피해배상 규정에 의거하여금전으로 배상 합니다.<br />
                    - "당사"는 어떤 경우에도 원상회복을 하지 아니하며 구입시기를 고려하여 감가상각
                    후 배상금액을 산정 하여 금전으로 배상합니다.(예 : 유리제품이 파손되어도 동일한
                    제품으로 배상하는 것이 아니고 구매시기를 고려하여 감가상각 후 금전으로
                    배상합니다)<br />
                    - 파손 사고 발생시 사고 발생일로부터 7일 이내에 사고접수가 있어야만 "당사"가
                    배상을 하며 접수시 구매 영수증 등의 증빙과 파손 현장 사진을 함께 첨부하여야
                    합니다.<br />
                    - 파손 사고에 대한 "당사"가 배상하는 한도는 최대 30만원 입니다.<br />
                    - 홈페이지의 “파손보상 관련 주의사항(고객님께 보상되지 않는 경우)에 나와 있는
                    주의의무를 고객이 해태하여 발생한 파손에 대해서는 배상하지 않습니다.<br />
                    - 천재지변 등의 불가항력적 사유 또는 고객의 주의의무 해태에 기인한 사유에 의한
                    사고는 배상하지 않습니다.<br />
                    <br />
                    제 14조 (회원의 게시물 및 저작권)<br />
                    ① "당사"는 다음 각 호에 해당하는 게시물 등을 회원의 사전 동의 없이 임의 게시,
                    중단, 수정, 삭제, 이동 또는 등록 거부 등의 관련 조치를 할 수 있습니다.<br />
                    1. 다른 회원 또는 제 3 자에게 심한 모욕을 주거나 명예를 손상시키는 내용인
                    경우<br />
                    2. 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우<br />
                    3. 불법복제 또는 해킹을 조장하는 내용인 경우<br />
                    4. 제 3 자의 저작권을 침해하여 게시중단 요청을 받은 경우<br />
                    5. 영리를 목적으로 하는 광고일 경우<br />
                    6. 범죄와 결부된다고 객관적으로 인정되는 내용일 경우<br />
                    7. 다른 이용자 또는 제 3 자의 저작권 등 기타 권리를 침해하는 내용인 경우<br />
                    8. "사적인 정치적 판단이나 종교적 견해의 내용으로 ""당사""가 서비스 성격에
                    부합하지 않는다고 판단하는 경우"<br />
                    9. "당사"에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는
                    경우<br />
                    10. 기타 관계법령에 위배된다고 판단되는 경우<br />
                    ② "회원이 게시한 게시물의 저작권은 게시한 회원에게 귀속됩니다. 단,"당사"는
                    서비스의 운영,전시, 전송, 배포, 홍보의 목적으로 회원의 별도 허락 없이 무상으로
                    저작권법에 규정하는 공정한 관행에 합치되게 회원의 게시물을 사용할 수
                    있습니다."<br />
                    ③ "당사"는 전항 이외의 방법으로 회원의 게시물을 이용하고자 하는 경우, 전화,
                    팩스, 전자우편 등의 방법을 통해 사전에 회원의 동의를 얻어야 합니다."<br />
                    ④ "회원이 이용계약 해지를 한 경우 타인에 의해 보관, 담기 등으로 재 게시 되거나
                    복제된 게시물과 타인의 게시물과 결합되어 제공되는 게시물, 공용 게시판에 등록된
                    게시물 등은 삭제되지 않습니다."<br />
                    <br />
                    [ 제 4장 의무사항 ]<br />
                    제 15조 (손해배상)<br />
                    ① "당사"는 이용자의 손해배상 요청시 "당사"의 서비스 이용 시 발생한 약관 제12조
                    및 제13조 따라 진행됩니다."<br />
                    ② "피해보상처리위원회의 논의 및 검토를 거쳐 손해배상이 이루어 지며, 이용자가
                    손해배상 정도에 불만족시 이에 대한 문제제기를 제기할 수 있습니다."<br /><br />
                    제 16조 (면책조항)<br />
                    ① 회사는 천재지변 기타 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없을
                    경우에는 서비스 제공 중지에 관한 책임을 면합니다.<br />
                    ② 회사는 이용자들의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을
                    면합니다.<br />
                    ③ 회사는 이용자가 서비스를 이용하여 얻은 정보 등으로 인해 입은 손해 등에
                    대하여는 책임을 면합니다.<br />
                    ④ 회사는 관계기관의 요청에 의한 서비스 중단, 퇴거 요청 등에 대해서는 책임을
                    면합니다.<br />
                    ⑤ 본사를 통해 접수를 하지 않아 전산에서 조회가 되지 않는 건에 대해 당사는 책임을
                    지지 않습니다.<br />
                    ⑥ 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한
                    손해에 대한 책임이 면제됩니다.<br />
                    ⑦ 회사는 이용자 상호간 및 이용자와 제 3자 상호 간에 서비스를 매개로 발생한
                    분쟁에 대해 개입할 의무가 없으며, 이로 인한 손해를 배상할 책임도 없습니다.<br />
                    ⑧ 회사는 회원이 서비스에 게재한 각종 정보, 자료, 사실의 신뢰도, 정확성 등 내용에
                    대하여 책임을 지지 않습니다.<br />
                    ⑨ 회사는 회원이 서비스를 이용하면서 얻은 자료로 인한 손해에 대하여 책임을 지지
                    않습니다. 또한 회사는 회원이 서비스를 이용하며 타 회원으로 인해 입게 되는 정신적
                    피해에 대하여 보상할 책임을 지지 않습니다.<br />
                    ⑩ 회사는 회원이 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 것에
                    대하여 책임을 지지 않습니다.<br /><br />
                    제 17조 (분쟁해결)<br />
                    ① "당사"는 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 해결하기
                    위해 노력합니다."<br />
                    ② 이외 약관에서 기록되지 않은 사항은 대한민국 준거법에 적용합니다.<br /><br />
                    제 18조 (재판권 및 준거법)<br />
                    ① "당사"와 이용자 간에 발생한 전자상거래 분쟁에 관한 소송은 ""당사""가 선택하는
                    법원의 전속관할로 합니다."<br />
                    ② "당사"와 이용자 간에 제기된 전자상거래 소송에는 한국법을 적용합니다.<br /><br />
                    제 19조 (특별규정)<br />
                    "당 약관에 명시되지 않은 사항은 전자거래기본법, 전자서명법, 전자성거래 등에서의
                    소비자보호에 관한 법률,기타 관련법령의 규정 및 국내(외)표준약관 등에
                    의합니다."<br /><br />
                    [ 부칙 ]<br />
                    본 약관은 2024년 09월 01일부터 시행됩니다.
                </p>
            </div>
        </div>
    </div>
</template>
